'use strict';
// task 1
// function pow(x,n)  // <- отсутствует пробел между аргументами
// {  // <- фигурная скобка на отдельной строке
//   let result=1;   // <- нет пробелов
//   for(let i=0;i<n;i++) {result*=x;}   // <- нет пробелов

//   return result;
// }

// let x=prompt("x?",''), n=prompt("n?",'')
// if (n<=0)  // <- нет пробелов
// {   // <- фигурная скобка на отдельной строке
//   alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
// }
// else // <- можно на одной строке, вместе: "} else {"
// {
//   alert(pow(x,n))  // нет пробелов и точки с запятой
// }
